# ResetPartShape Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Part..::..ResetPartShape Method
Part Class See Also
---
Resets all face offsets applied to part faces.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void ResetPartShape()
```

Visual Basic
---
```text
Public Sub ResetPartShape
```

Visual C++
---
```text
public:
void ResetPartShape()
```

# See Also
Part Class
Autodesk.Revit.DB Namespace